cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32_test/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <HTTPUpdate.h>
#include <WiFiClientSecure.h>
#include <esp_task_wdt.h> // Untuk Task Watchdog Timer
#include <Preferences.h>
#include <SPI.h>
#include <MFRC522.h>
#include <PubSubClient.h>
#include <ArduinoJson.h> // Tambahkan library ini untuk parsing JSON

// ========================================================================
// 1. ZONA KONFIGURASI UTAMA (EDIT PENGATURAN HANYA DI BAGIAN INI)
// ========================================================================

#define APP_VERSION         "1.1"               // Ganti angka ini setiap ada fitur baru!
#define GITHUB_USER         "cloudrisenx"       // Username GitHub kamu
#define GITHUB_REPO         "wanaraseta_gate"   // Nama Repository kamu

// Konfigurasi Hostpot Bawaan ESP32 (Saat pertama kali nyala / gagal konek)
#define DEFAULT_AP_SSID     "Wanara_Gate_Setup" 
#define DEFAULT_AP_PASSWORD "griyapersada"      

// Interval otomatis cek update ke GitHub (dalam milidetik, 7.200.000 = 2 Jam)
#define UPDATE_INTERVAL_MS  7200000             

#define LED_PIN             2                   // Pin LED Bawaan ESP32 (Build-in LED)
#define GATE_OPEN_MS        3000                // Lama gate terbuka (LED nyala) dalam milidetik (3 detik)

// Watchdog Timer configuration
#define WDT_TIMEOUT_SECONDS 5  // Dibuat lebih waspada: Jika loop() nge-hang > 5 detik, ESP akan restart

// Konfigurasi Barcode Scanner (UART2)
#define BARCODE_RX          16
#define BARCODE_TX          17
#define BARCODE_BAUD        9600  // Sesuaikan dengan baudrate scanner Anda

// ========================================================================
// KONFIGURASI RFID & MQTT
// ========================================================================
// Panduan Wiring MFRC522 ke ESP32 DevKit V1:
// SDA / SS    -> GPIO 21
// SCK / SCLK  -> GPIO 18
// MOSI        -> GPIO 23
// MISO        -> GPIO 19
// IRQ         -> (Tidak perlu disambung)
// RST         -> GPIO 22
// GND         -> GND
// 3.3V        -> 3V3 (PENTING: JANGAN KE 5V/VIN KARENA BISA RUSAK!)

#define SS_PIN              21
#define RST_PIN             22

// Variabel MQTT (Nilai default, akan ditimpa oleh pengaturan dari Web Dashboard)
String mqtt_server     = "127.0.0.1";
int    mqtt_port       = 1883;
String mqtt_user       = "gate_esp32_01";
String mqtt_pass       = "11223344";
String mqtt_client_id  = "gate_esp32_01";

// ========================================================================

WebServer server(80);
WiFiManager wm;
Preferences preferences;

MFRC522 mfrc522(SS_PIN, RST_PIN);
WiFiClient espClient;
PubSubClient mqttClient(espClient);

String folderAktif = "ESP32_test"; // Folder default untuk OTA, bisa diubah via Web Dashboard
String savedApSSID = DEFAULT_AP_SSID;

// ========================================================================
// 2. FUNGSI OTA GITHUB
// ========================================================================
void cekUpdateGitHub(bool fromWeb = false) {
  auto logMsg = [&](String msg) {
    Serial.print(msg);
    if (fromWeb) server.sendContent(msg);
  };

  logMsg("[OTA] Memeriksa update di cabang GitHub: main\n");

  // Rakit nama folder berdasarkan pilihan yang disimpan via Web Dashboard
  String folderPath = folderAktif;

  // Rakit URL secara dinamis berdasarkan konfigurasi di atas
  String urlVersi = String("https://raw.githubusercontent.com/") + GITHUB_USER + "/" + GITHUB_REPO + "/main/" + folderPath + "/version.txt";
  String urlFirmware = String("https://raw.githubusercontent.com/") + GITHUB_USER + "/" + GITHUB_REPO + "/main/" + folderPath + "/firmware.bin";

  WiFiClientSecure client;
  client.setInsecure(); // Bebas SSL

  HTTPClient http;
  http.begin(client, urlVersi);
  int httpCode = http.GET();

  bool doUpdate = false;

  if (httpCode == HTTP_CODE_OK) {
    String versiDiGitHub = http.getString();
    versiDiGitHub.trim();

    logMsg("[OTA] Versi ESP32   : " + String(APP_VERSION) + "\n");
    logMsg("[OTA] Versi GitHub  : " + versiDiGitHub + "\n");

    if (versiDiGitHub != APP_VERSION && versiDiGitHub.length() > 0) {
      logMsg("[OTA] >> UPDATE DITEMUKAN! File terbaru tersedia.\n");
      logMsg("[OTA] >> Sedang menyedot firmware...\n(Proses memakan waktu 1-2 menit, JANGAN TUTUP HALAMAN INI)\n");
      doUpdate = true;
    } else {
      logMsg("[OTA] >> Firmware sudah paling baru. Aman terkendali.\n");
    }
  } else {
    logMsg("[OTA] >> Gagal menghubungi GitHub (HTTP: " + String(httpCode) + "). Cek koneksi internet atau path folder.\n");
  }
  http.end();
  
  if (doUpdate) {
    httpUpdate.rebootOnUpdate(false); // Atur manual restart
    
    // Cara aman mematikan WDT di berbagai versi Core
    esp_task_wdt_delete(NULL); 

    t_httpUpdate_return ret = httpUpdate.update(client, urlFirmware);
    
    esp_task_wdt_add(NULL); 

    if (ret == HTTP_UPDATE_OK) {
      logMsg("\n[OTA] >> UPDATE SUKSES! ESP32 akan restart otomatis.\n");
      if (fromWeb) {
        server.sendContent("</pre><br><a href='/' class='btn-orange'>KEMBALI</a></div></body></html>");
        server.sendContent(""); // Sinyal end of chunk
      }
      delay(1000);
      ESP.restart();
    } else {
      logMsg("\n[OTA] >> GAGAL UPDATE: " + httpUpdate.getLastErrorString() + " (" + String(httpUpdate.getLastError()) + ")\n");
    }
  }
}

// ========================================================================
// 3. FUNGSI WEB DASHBOARD (HTML DENGAN RAW STRING LITERAL)
// ========================================================================
void handleRoot() {
  // HTML ditulis utuh dan rapi di dalam R"rawliteral(...)rawliteral"
  String html = R"rawliteral(
  <!DOCTYPE html>
  <html>
  <head>
    <meta charset='UTF-8'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <style>
      body { background: #000; color: #fff; font-family: sans-serif; text-align: center; padding: 20px; }
      .box { max-width: 420px; margin: 0 auto; padding: 20px; background: #111; border: 1px solid #333; }
      h2 { margin-bottom: 10px; font-weight: normal; }
      h3 { border-bottom: 1px solid #333; padding-bottom: 5px; font-size: 16px; margin-top: 20px; font-weight: normal; }
      .info-text { color: #aaa; font-size: 14px; margin-bottom: 25px; }
      input, select { width: 100%; padding: 12px; margin-top: 10px; box-sizing: border-box; background: #000; color: #fff; border: 1px solid #444; }
      input[type='submit'] { background: #222; cursor: pointer; font-weight: bold; margin-top: 15px; }
      input[type='submit']:hover { background: #333; }
      hr { border: 0; border-top: 1px solid #222; margin: 20px 0; }
    </style>
  </head>
  <body>
    <div class='box'>
      <h2>Wanara Seta - Gate Portal</h2>
      <div class='info-text'>
        <p>Versi Firmware : <strong style='color:#fff;'>{{VERSION}}</strong></p>
        <p>Target Mesin   : <strong style='color:#fff;'>{{FOLDER}}</strong></p>
      </div>

      <hr>
      <h3>Pengaturan Mesin/Board</h3>
      <form action='/save_folder' method='POST'>
        <select name='folder_name'>
          <option value='ESP32main' {{SEL_ESP32MAIN}}>Mesin ESP32 (ESP32main)</option>
          <option value='ESP32_test' {{SEL_ESP32TEST}}>Mesin ESP32 Test (ESP32_test)</option>
          <option value='WT32main' {{SEL_WT32MAIN}}>Mesin WT32 (WT32main)</option>
          <option value='WT32_test' {{SEL_WT32TEST}}>Mesin WT32 Test (WT32_test)</option>
          <option value='src_mainOTA' {{SEL_SRCMAINOTA}}>Main OTA (src_mainOTA)</option>
        </select>
        <input type='submit' value='SIMPAN PENGATURAN & RESTART'>
      </form>

      <hr>
      <h3>Pengaturan MQTT Broker</h3>
      <form action='/save_mqtt' method='POST'>
        <input type='text' name='mqtt_server' placeholder='IP Server (contoh: 192.168.4.50)' value='{{MQTT_SERVER}}' required>
        <input type='number' name='mqtt_port' placeholder='Port (contoh: 1883)' value='{{MQTT_PORT}}' required>
        <input type='text' name='mqtt_user' placeholder='Username MQTT' value='{{MQTT_USER}}' required>
        <input type='password' name='mqtt_pass' placeholder='Password MQTT' value='{{MQTT_PASS}}'>
        <input type='text' name='mqtt_client_id' placeholder='Client ID (contoh: Gate_02)' value='{{MQTT_CLIENT_ID}}' required>
        <input type='submit' value='SIMPAN MQTT & RESTART'>
      </form>

      <hr>
      <h3>Sistem</h3>
      <form action='/forget_wifi' method='POST' onsubmit="return confirm('Yakin ingin menghapus WiFi? Alat akan restart ke mode setup.')">
        <input type='submit' value='LUPAKAN WIFI (RESET KONEKSI)'>
      </form>

      <hr>
      <form action='/cek_update' method='GET'>
        <input type='submit' value='CEK UPDATE GITHUB SEKARANG'>
      </form>
    </div>
  </body>
  </html>
  )rawliteral";

  // Me-replace template teks dengan variabel C++ agar dinamis
  html.replace("{{VERSION}}", APP_VERSION);
  html.replace("{{FOLDER}}", folderAktif);
  html.replace("{{SEL_ESP32MAIN}}", folderAktif == "ESP32main" ? "selected" : "");
  html.replace("{{SEL_ESP32TEST}}", folderAktif == "ESP32_test" ? "selected" : "");
  html.replace("{{SEL_WT32MAIN}}", folderAktif == "WT32main" ? "selected" : "");
  html.replace("{{SEL_WT32TEST}}", folderAktif == "WT32_test" ? "selected" : "");
  html.replace("{{SEL_SRCMAINOTA}}", folderAktif == "src_mainOTA" ? "selected" : "");
  
  html.replace("{{MQTT_SERVER}}", mqtt_server);
  html.replace("{{MQTT_PORT}}", String(mqtt_port));
  html.replace("{{MQTT_USER}}", mqtt_user);
  html.replace("{{MQTT_PASS}}", mqtt_pass);
  html.replace("{{MQTT_CLIENT_ID}}", mqtt_client_id);

  server.send(200, "text/html", html);
}

void handleSaveFolder() {
  if (server.hasArg("folder_name")) {
    String newFolder = server.arg("folder_name");
    preferences.begin("gate_config", false);
    preferences.putString("ota_folder", newFolder);
    preferences.end();

