cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32_test/main.cpp
    String html = "<html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1'><meta http-equiv='refresh' content='5;url=/'><style>body{background:#000;color:#fff;text-align:center;padding:50px;font-family:sans-serif;} a{background:#222;color:#fff;padding:12px 20px;text-decoration:none;border:1px solid #444;display:inline-block;margin-top:20px;font-weight:bold;}</style></head><body><h2>Target mesin diubah ke: " + newFolder + "</h2><p style='color:#aaa;'>Sistem sedang di-restart (Otomatis kembali dalam 5 detik)...</p><a href='/'>KEMBALI KE DASHBOARD</a></body></html>";
    server.send(200, "text/html", html);
    esp_task_wdt_delete(NULL); 
    delay(2000);
    ESP.restart();
  }
}

void handleSaveMqtt() {
  if (server.hasArg("mqtt_server")) {
    mqtt_server = server.arg("mqtt_server");
    mqtt_port = server.arg("mqtt_port").toInt();
    mqtt_user = server.arg("mqtt_user");
    mqtt_pass = server.arg("mqtt_pass");
    mqtt_client_id = server.arg("mqtt_client_id");

    preferences.begin("gate_config", false);
    preferences.putString("mqtt_server", mqtt_server);
    preferences.putInt("mqtt_port", mqtt_port);
    preferences.putString("mqtt_user", mqtt_user);
    preferences.putString("mqtt_pass", mqtt_pass);
    preferences.putString("mqtt_client_id", mqtt_client_id);
    preferences.end();

    String html = "<html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1'><meta http-equiv='refresh' content='5;url=/'><style>body{background:#000;color:#fff;text-align:center;padding:50px;font-family:sans-serif;} a{background:#222;color:#fff;padding:12px 20px;text-decoration:none;border:1px solid #444;display:inline-block;margin-top:20px;font-weight:bold;}</style></head><body><h2>Pengaturan MQTT Disimpan!</h2><p style='color:#aaa;'>Sistem sedang di-restart (Otomatis kembali dalam 5 detik)...</p><a href='/'>KEMBALI KE DASHBOARD</a></body></html>";
    server.send(200, "text/html", html);
    esp_task_wdt_delete(NULL); 
    delay(2000);
    ESP.restart();
  }
}

void handleForgetWifi() {
  String html = "<html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1'><style>body{background:#000;color:#fff;text-align:center;padding:50px;font-family:sans-serif;}</style></head><body><h2>WiFi Telah Dilupakan!</h2><p style='color:#aaa;'>ESP32 akan restart dan masuk ke mode Hotspot Setup (Wanara_Gate_Setup).</p><p style='color:#aaa;'>Silakan hubungkan HP Anda ke WiFi tersebut untuk mengatur koneksi baru.</p></body></html>";
  server.send(200, "text/html", html);
  
  Serial.println("[WIFI] Perintah Forget WiFi diterima. Menghapus kredensial...");
  delay(2000);
  wm.resetSettings(); // Menghapus SSID & Password dari memori NVS
  esp_task_wdt_delete(NULL); 
  ESP.restart();
}

void handleCekUpdate() {
  String html = "<html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width, initial-scale=1'><meta http-equiv='refresh' content='2;url=/do_update'><style>body{background:#000;color:#fff;text-align:center;padding:50px;font-family:sans-serif;} .loader{border:4px solid #222;border-top:4px solid #fff;border-radius:50%;width:40px;height:40px;animation:spin 1s linear infinite;margin:20px auto;} @keyframes spin{0%{transform:rotate(0deg);}100%{transform:rotate(360deg);}}</style></head><body><h2>Menghubungi GitHub...</h2><div class='loader'></div><p style='color:#aaa;'>Sistem sedang memproses OTA, mohon tunggu sebentar...</p></body></html>";
  server.send(200, "text/html", html);
}

void handleDoUpdate() {
  server.setContentLength(CONTENT_LENGTH_UNKNOWN);
  server.send(200, "text/html", ""); // Mulai mode chunked live streaming

  String htmlStart = R"rawliteral(
  <!DOCTYPE html>
  <html>
  <head>
    <meta charset='UTF-8'>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <style>
      body { background: #000; color: #fff; font-family: sans-serif; text-align: center; padding: 20px; }
      .box { max-width: 500px; margin: 0 auto; padding: 20px; background: #111; border: 1px solid #333; }
      h2 { margin-bottom: 20px; font-weight: normal; }
      pre { background: #000; padding: 15px; border: 1px solid #222; text-align: left; overflow-x: auto; color: #0f0; font-size: 13px; white-space: pre-wrap; word-wrap: break-word; }
      a { background: #222; color: #fff; width: 100%; padding: 12px; border: 1px solid #444; text-decoration: none; display: inline-block; margin-top: 20px; box-sizing: border-box; font-weight: bold; }
      a:hover { background: #333; }
    </style>
  </head>
  <body>
    <div class='box'>
      <h2>Hasil Proses OTA</h2>
      <pre>)rawliteral";

  server.sendContent(htmlStart);
  
  // Eksekusi update dan streaming log ke web perlahan-lahan
  cekUpdateGitHub(true);
  
  // Jika gagal/tidak butuh update, tutup tag HTML-nya
  server.sendContent("</pre><a href='/'>KEMBALI KE DASHBOARD</a></div></body></html>");
  server.sendContent(""); // Sinyal selesai HTTP
}

// ========================================================================
// FUNGSI KONTROL GERBANG
// ========================================================================
unsigned long gateOpenTime = 0;
bool isGateOpen = false;

void openGate() {
  isGateOpen = true;
  gateOpenTime = millis();
  digitalWrite(LED_PIN, HIGH); // Nyalakan LED (Atau trigger RELAY untuk buka gerbang)
  Serial.println("[GATE] Gerbang Terbuka (Relay ON)");
}

void handleGate() {
  // Jika gerbang sedang terbuka dan waktunya (3 detik) sudah habis
  if (isGateOpen && (millis() - gateOpenTime > GATE_OPEN_MS)) {
    isGateOpen = false;
    digitalWrite(LED_PIN, LOW); // Matikan LED (Tutup RELAY)
    Serial.println("[GATE] Waktu habis. Gerbang Tertutup (Relay OFF)");
  }
}

// ========================================================================
// CALLBACK MQTT (Saat menerima pesan dari Server)
// ========================================================================
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String message;
  for (unsigned int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  Serial.printf("\n[MQTT] Pesan masuk di topik: %s\n", topic);
  Serial.println("[MQTT] Payload: " + message);

