cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32_test/main.cpp
  JsonDocument doc; // Menggunakan ArduinoJson v7 (Jika v6, gunakan DynamicJsonDocument doc(512);)
  DeserializationError error = deserializeJson(doc, message);
  if (error) {
    Serial.println("[JSON] Gagal mem-parsing payload dari server.");
    return;
  }

  String topicStr = String(topic);
  String resTopic = "gate/" + mqtt_client_id + "/result";
  String cmdTopic = "gate/" + mqtt_client_id + "/command";

  // Skenario 1: Cek status validitas kartu
  if (topicStr == resTopic) {
    String status = doc["status"];
    if (status == "valid") {
      Serial.println("[AKSES] Diberikan! Pesan: " + doc["message"].as<String>());
      openGate(); // Buka gerbang
    } else if (status == "invalid") {
      Serial.println("[AKSES] Ditolak! Alasan: " + doc["message"].as<String>());
    }
  } 
  // Skenario 2: Command Manual
  else if (topicStr == cmdTopic) {
    String cmd = doc["command"];
    if (cmd == "open_gate") {
      Serial.println("[COMMAND] Perintah Override: Buka Gerbang!");
      openGate();
    } else if (cmd == "reboot") {
      Serial.println("[COMMAND] Perintah Reboot dari server. Restarting...");
      esp_task_wdt_delete(NULL); 
      delay(1000);
      ESP.restart();
    }
  }
}

// ========================================================================
// FUNGSI MQTT
// ========================================================================
unsigned long lastMqttReconnectAttempt = 0;

void reconnectMQTT() {
  Serial.printf("[MQTT] Melakukan TCP Ping ke %s:%d...\n", mqtt_server.c_str(), mqtt_port);
  
  // Cek apakah server dan port 1883 bisa dijangkau
  if (!espClient.connect(mqtt_server.c_str(), mqtt_port)) {
    Serial.println("[MQTT] ERROR: Ping Gagal! Server tidak dapat dijangkau.");
    Serial.println("[MQTT] Saran: Cek IP, apakah EMQX berjalan, atau UFW/Firewall memblokir port 1883.");
    return; // Langsung keluar agar Web Dashboard tetap responsif
  }
  espClient.stop(); // Tutup koneksi TCP sementara karena ping sukses
  Serial.println("[MQTT] Ping Sukses! Server aktif.");

  Serial.print("[MQTT] Melakukan Autentikasi ke EMQX Broker...");
  if (mqttClient.connect(mqtt_client_id.c_str(), mqtt_user.c_str(), mqtt_pass.c_str())) {
    Serial.println(" Terhubung!");
    
    String resTopic = "gate/" + mqtt_client_id + "/result";
    String cmdTopic = "gate/" + mqtt_client_id + "/command";
    
    mqttClient.subscribe(resTopic.c_str());
    mqttClient.subscribe(cmdTopic.c_str());
    
    Serial.println("[MQTT] Berhasil subscribe ke topik result & command.");
  } else {
    Serial.print(" Gagal, rc=");
    Serial.println(mqttClient.state());
  }
}

// ========================================================================
// 4. SETUP & MAIN LOOP
// ========================================================================
void setup() {
  Serial.begin(115200);
  delay(1000);
  Serial.println("\n==================================================");
  Serial.println("   [MODE TEST BARCODE] WiFi & MQTT DINONAKTIFKAN  ");
  Serial.println("==================================================");

#if 0 // Ganti jadi 1 untuk mengaktifkan WiFi, Web Server, & RFID kembali
  // Ambil data folder aktif dan nama AP WiFi dari memori internal
  preferences.begin("gate_config", true);
  folderAktif = preferences.getString("ota_folder", "ESP32main");
  savedApSSID = preferences.getString("ap_ssid", DEFAULT_AP_SSID); // Mengambil dari const di atas

  // Load konfigurasi MQTT (Jika tidak ada, fallback ke nilai variabel global)
  mqtt_server = preferences.getString("mqtt_server", mqtt_server);
  mqtt_port = preferences.getInt("mqtt_port", mqtt_port);
  mqtt_user = preferences.getString("mqtt_user", mqtt_user);
  mqtt_pass = preferences.getString("mqtt_pass", mqtt_pass);
  mqtt_client_id = preferences.getString("mqtt_client_id", mqtt_client_id);
  preferences.end();

  // Memulai WiFi Manager (Jika gagal konek, panggil AP dan Password dari const di atas)
  Serial.println("\n[WIFI] Mencoba terhubung ke jaringan...");
  wm.autoConnect(savedApSSID.c_str(), DEFAULT_AP_PASSWORD);
  Serial.println("[WIFI] Sukses Terhubung! IP Web Dashboard: " + WiFi.localIP().toString());

  // Routing Halaman Web
  server.on("/", handleRoot);
  server.on("/save_folder", HTTP_POST, handleSaveFolder);
  server.on("/save_mqtt", HTTP_POST, handleSaveMqtt);
  server.on("/cek_update", HTTP_GET, handleCekUpdate);
  server.on("/forget_wifi", HTTP_POST, handleForgetWifi);
  server.on("/do_update", HTTP_GET, handleDoUpdate);
  server.begin();

  // Setup SPI & RFID
  SPI.begin(); // Otomatis menggunakan VSPI ESP32 (SCK=18, MISO=19, MOSI=23)
  mfrc522.PCD_Init();
  Serial.println("[RFID] Sensor MFRC522 Siap.");
#endif

  // Setup Barcode Scanner (UART2)
  Serial2.begin(BARCODE_BAUD, SERIAL_8N1, BARCODE_RX, BARCODE_TX);
  Serial.println("[BARCODE] Scanner UART2 Siap (GPIO 16/17).");

#if 0 // Ganti jadi 1 untuk mengaktifkan MQTT & WDT kembali
  // Setup MQTT Broker
  mqttClient.setServer(mqtt_server.c_str(), mqtt_port);
  mqttClient.setCallback(mqttCallback); // Daftarkan fungsi callback
  mqttClient.setBufferSize(512);        // Perbesar buffer agar JSON aman

  // Aktifkan Task Watchdog Timer SETELAH WiFi Terhubung (Mencegah restart saat loading WiFi)
  #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
    esp_task_wdt_config_t twdt_config = {
        .timeout_ms = WDT_TIMEOUT_SECONDS * 1000,
        .idle_core_mask = 0,
        .trigger_panic = true
    };
    esp_task_wdt_reconfigure(&twdt_config);
  #else
    esp_task_wdt_init(WDT_TIMEOUT_SECONDS, true); 
  #endif
  
  esp_task_wdt_add(NULL); 
#endif

  // Setup Pin LED sebagai Output
  pinMode(LED_PIN, OUTPUT);
}

void loop() {
#if 0 // Ganti jadi 1 untuk mengaktifkan proses WebServer, WDT, & MQTT kembali
  server.handleClient(); // Jaga agar server web tetap responsif

  // Beri makan Task Watchdog Timer agar tidak reset
  esp_task_wdt_reset();

  // Jaga koneksi MQTT tetap hidup
  if (WiFi.status() == WL_CONNECTED) {
    if (!mqttClient.connected()) {
      // Coba sambung ulang setiap 5 detik tanpa memblokir sistem
      if (millis() - lastMqttReconnectAttempt > 5000) {
        lastMqttReconnectAttempt = millis();
        reconnectMQTT();
      }
    } else {
      mqttClient.loop();
    }
  }
#endif

  // Logika Pembacaan Barcode (UART2) - Non-Blocking & Anti-Timeout (Mode Debug)
  static String barcodeBuffer = "";
  static unsigned long lastBarcodeCharTime = 0;
  const unsigned long barcodeTimeoutMs = 50; // Batas jeda waktu antar karakter (ms)

