cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32_test/main.cpp
  while (Serial2.available() > 0) {
    char c = Serial2.read();
    lastBarcodeCharTime = millis();
    
    // Tampilkan setiap byte/karakter mentah yang masuk ke Serial Monitor untuk analisis
    if (c >= 32 && c <= 126) {
      Serial.print(c);
    } else {
      Serial.printf("[0x%02X]", c); // Menampilkan kode ASCII heksadesimal untuk karakter non-printable (seperti \r atau \n)
    }

    // Jika mendeteksi karakter terminator (Enter/New Line)
    if (c == '\r' || c == '\n') {
      barcodeBuffer.trim();
      if (barcodeBuffer.length() > 0) {
        Serial.println("\n[BARCODE] Terdeteksi! Data: " + barcodeBuffer);
        barcodeBuffer = ""; // Kosongkan buffer setelah selesai diproses
      }
    } else {
      barcodeBuffer += c; // Masukkan karakter ke buffer
    }
  }

  // Pengaman jika scanner tidak mengirimkan karakter \r atau \n (tanpa suffix/akhiran)
  // Jika ada data di buffer dan sudah tidak ada karakter baru masuk selama 50ms, langsung proses.
  if (barcodeBuffer.length() > 0 && (millis() - lastBarcodeCharTime > barcodeTimeoutMs)) {
    barcodeBuffer.trim();
    if (barcodeBuffer.length() > 0) {
      Serial.println("\n[BARCODE] Terdeteksi (Timeout/No-Suffix)! Data: " + barcodeBuffer);
    }
    barcodeBuffer = ""; // Reset buffer
  }

#if 0 // Ganti jadi 1 untuk mengaktifkan pembacaan RFID kembali
  // Logika Pembacaan RFID
  static unsigned long lastRFIDReadTime = 0;

  if (mfrc522.PICC_IsNewCardPresent() && mfrc522.PICC_ReadCardSerial()) {
    if (millis() - lastRFIDReadTime > 1000) { // Cooldown 1 detik tanpa memblokir sistem
      String rfidUid = "";
      for (byte i = 0; i < mfrc522.uid.size; i++) {
        rfidUid += String(mfrc522.uid.uidByte[i] < 0x10 ? "0" : "");
        rfidUid += String(mfrc522.uid.uidByte[i], HEX);
      }
      rfidUid.toUpperCase();
      Serial.println("[RFID] Kartu Terdeteksi! UID: " + rfidUid);

      // Cek apakah ini Kartu Master Hardcode (Bypass akses offline)
      if (rfidUid == "A166C820") {
        Serial.println("[MASTER] Kartu Master dikenali! Buka gerbang langsung tanpa MQTT.");
        openGate();
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      } else {
        // Kirim Payload ke EMQX Broker (Sesuai Requirement 1 & 2)
        String payload = "{\"rfid\":\"" + rfidUid + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
        String pubTopic = "gate/" + mqtt_client_id + "/scan/in";
        
        if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
          Serial.println("[MQTT] SUKSES Terkirim ke " + pubTopic);
        } else {
          Serial.println("[MQTT] GAGAL Mengirim! Cek koneksi atau ukuran buffer.");
        }
        
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      }

      lastRFIDReadTime = millis();
    }
  }
#endif

  // Tangani timer penutupan gerbang otomatis
  handleGate();
}